public class Main {
    public static void main(String[] args) {

        // ДОМАШНЕЕ ЗАДАНИЕ 2

        // task1
        System.out.println("Задание 1.");
        //Напишите программу, которая выводит в консоль все високосные года, начиная с 1904 года до 2096.
        // В консоль результат должен выводиться в формате "… год является високосным"
        for (int i=1904; i<2096; i=i+4){
            System.out.println(i+" год является високосным.");
        }
        }
    }











